CF/DataProcessors/ПечатьТТН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПечатьТТН</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомерПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицензионнаяКарточка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодительскоеУдостоверение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

CF/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ЗаказНаПеремещение</xr:Item>
				<xr:Item>Document.ИзменениеАссортимента</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СебестоимостьНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыТоваров</xr:Item>
				<xr:Item>InformationRegister.ДвиженияСерийныхНомеров</xr:Item>
				<xr:Item>AccumulationRegister.СебестоимостьПоставкиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПоступлению</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОтгрузке</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОформлениюОтчетовКомитенту</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеТранспортногоРаздела</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАссортимента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратИзРегистра2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МагазинОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МагазинПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатусОбработки_ЕГАИС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиТТНВходящейЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТТНИсходящаяЕГАИС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТТНИсходящаяЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТТНВходящаяЕГАИС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТТНВходящаяЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТоварноТранспортнаяНакладнаяЕГАИСИсходящая</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТТНВходящаяЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязиСерийныхНомеров</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерийОтправитель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерийПолучатель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСправка1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки1ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерийныеНомера</Name>
					<Comment>Номера подарочных сертификатов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Comment>Номер подарочного сертификата</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерийныеНомера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязиСерийныхНомеров</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/DataProcessors/ПечатьТТН/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ПечатьПослеЗакрытия")
		И Параметры.ПечатьПослеЗакрытия Тогда
		
		ПечатьПослеЗакрытия = Параметры.ПечатьПослеЗакрытия;
		СсылкиНаДокументы = Параметры.СсылкиНаДокументы;
		Если СсылкиНаДокументы.Количество() > 0 Тогда
			Объект.Документ = СсылкиНаДокументы[0];
			Элементы.Документ.ТолькоПросмотр = Истина;
		КонецЕсли;
		Если Параметры.Свойство("ДополнительныеПараметры") Тогда
			ПараметрыПечати = Параметры.ДополнительныеПараметры;
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("Документ") Тогда
		Объект.Документ = Параметры.Документ;
	КонецЕсли;
	Если Параметры.Свойство("Редактирование") Тогда
		Элементы.ФормаКнопкаПечатьТТН.Видимость = Ложь;
		Элементы.ФормаСохранить.Видимость = Истина;
		Элементы.ФормаСохранить.КнопкаПоУмолчанию = Истина;
		Элементы.Документ.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ФормаКнопкаПечатьТТН.Видимость = Истина;
		Элементы.ФормаСохранить.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтключитьОтметкуНезаполненного();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	ЗаполнитьПоДокументу();	
	ОтключитьОтметкуНезаполненного();
	
КонецПроцедуры

&НаКлиенте
Процедура МаркаАвтомобиляПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерАвтомобиляПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МаркаПрицепаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерПрицепаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВодительскоеУдостоверениеПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПунктПогрузкиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПунктРазгрузкиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СрокДоставкиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЛицензионнаяКарточкаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьТТН(Команда)
	
	Если НЕ ТипЗнч(ПараметрыПечати) = Тип("Структура") Тогда
		ПараметрыПечати = Новый Структура;
	КонецЕсли;
	ПараметрыПечати.Вставить("СрокДоставки", Объект.СрокДоставки);
	ПараметрыПечати.Вставить("МаркаАвтомобиля", Объект.МаркаАвтомобиля);
	ПараметрыПечати.Вставить("МаркаПрицепа", Объект.МаркаПрицепа);
	ПараметрыПечати.Вставить("ГосНомерАвтомобиля", Объект.ГосНомерАвтомобиля);
	ПараметрыПечати.Вставить("ГосНомерПрицепа", Объект.ГосНомерПрицепа);
	ПараметрыПечати.Вставить("ПунктПогрузки", Объект.ПунктПогрузки);
	ПараметрыПечати.Вставить("ПунктРазгрузки", Объект.ПунктРазгрузки);
	ПараметрыПечати.Вставить("Водитель", Объект.Водитель);
	ПараметрыПечати.Вставить("Перевозчик", Объект.Перевозчик);
	ПараметрыПечати.Вставить("Заказчик", Объект.Заказчик);
	ПараметрыПечати.Вставить("ВидПеревозки", Объект.ВидПеревозки);
	ПараметрыПечати.Вставить("ЛицензионнаяКарточка", ?(Объект.ЛицензионнаяКарточка, "Стандартная", "Ограниченная"));
	ПараметрыПечати.Вставить("ВодительскоеУдостоверение", Объект.ВодительскоеУдостоверение);
	ПараметрыПечати.Вставить("Представление", НСтр("ru = '1-Т (Товарно - транспортная накладная)'"));
	
	Если Модифицированность Тогда
		СохранитьВДокумент();
	КонецЕсли;
	
	Если ПечатьПослеЗакрытия Тогда
		Закрыть(ПараметрыПечати);
	Иначе
		ИмяМенеджераПечати = ?(ТипЗнч(Объект.Документ) = Тип("ДокументСсылка.ПеремещениеТоваров"),"Документ.ПеремещениеТоваров","Документ.РеализацияТоваров");
		
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(Объект.Документ);
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ИмяМенеджераПечати,
				"ТТН",
				МассивДокументов,
				ЭтаФорма,
				ПараметрыПечати);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("СрокДоставки", Объект.СрокДоставки);
	СтруктураРеквизитов.Вставить("МаркаАвтомобиля", СокрЛП(Объект.МаркаАвтомобиля));
	СтруктураРеквизитов.Вставить("МаркаПрицепа", СокрЛП(Объект.МаркаПрицепа));
	СтруктураРеквизитов.Вставить("ГосНомерАвтомобиля", СокрЛП(Объект.ГосНомерАвтомобиля));
	СтруктураРеквизитов.Вставить("ГосНомерПрицепа", СокрЛП(Объект.ГосНомерПрицепа));
	СтруктураРеквизитов.Вставить("ПунктПогрузки", СокрЛП(Объект.ПунктПогрузки));
	СтруктураРеквизитов.Вставить("ПунктРазгрузки", СокрЛП(Объект.ПунктРазгрузки));
	СтруктураРеквизитов.Вставить("Водитель", СокрЛП(Объект.Водитель));
	СтруктураРеквизитов.Вставить("Перевозчик", СокрЛП(Объект.Перевозчик));
	СтруктураРеквизитов.Вставить("Заказчик", СокрЛП(Объект.Заказчик));
	СтруктураРеквизитов.Вставить("ВидПеревозки", СокрЛП(Объект.ВидПеревозки));
	СтруктураРеквизитов.Вставить("ЛицензионнаяКарточка", ?(Объект.ЛицензионнаяКарточка, "Стандартная", "Ограниченная"));
	СтруктураРеквизитов.Вставить("ВодительскоеУдостоверение", СокрЛП(Объект.ВодительскоеУдостоверение));
	Закрыть(СтруктураРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоДокументу()
	
	Если ЗначениеЗаполнено(Объект.Документ) Тогда
		ДанныеТранспортногоРаздела = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Документ, "ДанныеТранспортногоРаздела");
		Если ДанныеТранспортногоРаздела <> Неопределено Тогда
			СтруктураРеквизитов = ДанныеТранспортногоРаздела.Получить();
			Если ТипЗнч(СтруктураРеквизитов) = Тип("Структура") Тогда
				Если СтруктураРеквизитов.Свойство("СрокДоставки") Тогда
					Объект.СрокДоставки = СтруктураРеквизитов.СрокДоставки;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("МаркаАвтомобиля") Тогда
					Объект.МаркаАвтомобиля = СтруктураРеквизитов.МаркаАвтомобиля;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("МаркаПрицепа") Тогда
					Объект.МаркаПрицепа = СтруктураРеквизитов.МаркаПрицепа;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ГосНомерАвтомобиля") Тогда
					Объект.ГосНомерАвтомобиля = СтруктураРеквизитов.ГосНомерАвтомобиля;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ГосНомерПрицепа") Тогда
					Объект.ГосНомерПрицепа = СтруктураРеквизитов.ГосНомерПрицепа;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ПунктПогрузки") Тогда
					Объект.ПунктПогрузки = СтруктураРеквизитов.ПунктПогрузки;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ПунктРазгрузки") Тогда
					Объект.ПунктРазгрузки = СтруктураРеквизитов.ПунктРазгрузки;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("Водитель") Тогда
					Объект.Водитель = СтруктураРеквизитов.Водитель;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("Перевозчик") Тогда
					Объект.Перевозчик = СтруктураРеквизитов.Перевозчик;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("Заказчик") Тогда
					Объект.Заказчик = СтруктураРеквизитов.Заказчик;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ВидПеревозки") Тогда
					Объект.ВидПеревозки = СтруктураРеквизитов.ВидПеревозки;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ЛицензионнаяКарточка") Тогда
					Если СтруктураРеквизитов.ЛицензионнаяКарточка = "Стандартная" Тогда
						Объект.ЛицензионнаяКарточка = Истина;
					Иначе
						Объект.ЛицензионнаяКарточка = Ложь;
					КонецЕсли;
				КонецЕсли;
				Если СтруктураРеквизитов.Свойство("ВодительскоеУдостоверение") Тогда
					Объект.ВодительскоеУдостоверение = СтруктураРеквизитов.ВодительскоеУдостоверение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВДокумент()
	
	Если ЗначениеЗаполнено(Объект.Документ) Тогда
		ДокументОбъект = Объект.Документ.ПолучитьОбъект();
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("СрокДоставки", Объект.СрокДоставки);
		СтруктураРеквизитов.Вставить("МаркаАвтомобиля", СокрЛП(Объект.МаркаАвтомобиля));
		СтруктураРеквизитов.Вставить("МаркаПрицепа", СокрЛП(Объект.МаркаПрицепа));
		СтруктураРеквизитов.Вставить("ГосНомерАвтомобиля", СокрЛП(Объект.ГосНомерАвтомобиля));
		СтруктураРеквизитов.Вставить("ГосНомерПрицепа", СокрЛП(Объект.ГосНомерПрицепа));
		СтруктураРеквизитов.Вставить("ПунктПогрузки", СокрЛП(Объект.ПунктПогрузки));
		СтруктураРеквизитов.Вставить("ПунктРазгрузки", СокрЛП(Объект.ПунктРазгрузки));
		СтруктураРеквизитов.Вставить("Водитель", СокрЛП(Объект.Водитель));
		СтруктураРеквизитов.Вставить("Перевозчик", СокрЛП(Объект.Перевозчик));
		СтруктураРеквизитов.Вставить("Заказчик", СокрЛП(Объект.Заказчик));
		СтруктураРеквизитов.Вставить("ВидПеревозки", СокрЛП(Объект.ВидПеревозки));
		СтруктураРеквизитов.Вставить("ЛицензионнаяКарточка", ?(Объект.ЛицензионнаяКарточка, "Стандартная", "Ограниченная"));
		СтруктураРеквизитов.Вставить("ВодительскоеУдостоверение", СокрЛП(Объект.ВодительскоеУдостоверение));
		
		ДокументОбъект.ДанныеТранспортногоРаздела = Новый ХранилищеЗначения(СтруктураРеквизитов);
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
